#pragma once

//플레이어 입력값
#define KEY_UP 72
#define KEY_DOWN 80
#define KEY_LEFT 75
#define KEY_RIGHT 77
#define KEY_ENTER 13
#define KEY_ESC 27

//플레이어 구조체
typedef struct Player {
	int HP;
	int SP;
} Player;

//선택지 구조체 : text는 선택지 문구, apply는 선택지 선택 시 실행할 함수 이름
typedef struct Option {
	const char* text;
	void (*apply)(struct Player*); //함수 포인터로 함수를 변수처럼 사용할 수 있게 해 줌. 선택지에 따라 함수를 매칭
} Option;

//상황 구조체 : 보여줄 아스키 아트[screen], 상황 설명[text], 선택지 3가지[options]
typedef struct Scene {
	const char* screen;
	const char* text;
	Option options[3];
} Scene;

static const char* title[5] = {
    " ___  ___  ___  ___  ___  ___   ___  ___  ___  ___  ___  ___ ",
    "| __>| . || . \\| __>/ __>|_ _| | __>/ __>|  _>| . || . \\| __>",
    "| _> | | ||   /| _> \\__ \\ | |  | _> \\__ \\| <__|   ||  _/| _> ",
    "|_|  `___'|_\\_\\|___><___/ |_|  |___><___/`___/|_|_||_|  |___>",
    "                                                              "
};

static const char* pauseText[5] = {
    " ___  ___  _ _  ___  ___ ",
    "| . \\| . || | |/ __>| __>",
    "|  _/|   || ' |\\__ \\| _> ",
    "|_|  |_|_|`___'<___/|___>",
    "                          "
};

static const char* overTitle[7] = {
        "          _____          __  __ ______    ______      ________ _____  ",
        "         / ____|   /\\   |  \\/  |  ____|  / __ \\ \\    / /  ____|  __ \\ ",
        "        | |  __   /  \\  | \\  / | |__    | |  | \\ \\  / /| |__  | |__) |",
        "        | | |_ | / /\\ \\ | |\\/| |  __|   | |  | |\\ \\/ / |  __| |  _  / ",
        "        | |__| |/ ____ \\| |  | | |____  | |__| | \\  /  | |____| | \\ \\ ",
        "         \\_____/_/    \\_\\_|  |_|______|  \\____/   \\/   |______|_|  \\_\\",
        "                                                                       ",
};

static const char* outro[5] = {
    "하아... 힘들다...",
    "어..? 저건 팻말...?",
    "사람.. 사람이다!!",
    "저기요!! 여기 도와주세요!!",
    "..."
};

static const char* intro[10] = {
    "데굴 데굴 덱데굴",
    "...",
    "....",
    ".....",
    ".....으음..",
    "으윽... 여긴 어디지...",
    "발을 삐끗해서 굴렀는데...",
    "숲 속에 조난 당한건가...",
    "(주머니를 뒤적이며) 가진 게 아무것도 없잖아..!",
    "하아... 천천히 주변을 둘러보며 걸어보자..."
};